"""
اطلاعات کنکورهای ۱۴۰۵
"""

EXAMS_1405 = {
    "علوم_انسانی": {
        "name": "کنکور علوم انسانی",
        "date": (2026, 6, 30),  # 11 تیر 1405
        "time": "08:00",
        "persian_date": "۱۱ تیر ۱۴۰۵"
    },
    "ریاضی_فنی": {
        "name": "کنکور ریاضی و فنی",
        "date": (2026, 6, 30),  # 11 تیر 1405
        "time": "08:00",
        "persian_date": "۱۱ تیر ۱۴۰۵"
    },
    "فرهنگیان": {
        "name": "کنکور فرهنگیان",
        "date": [(2026, 5, 6), (2026, 5, 7)],  # 17 و 18 اردیبهشت 1405
        "time": "08:00",
        "persian_date": "۱۷ و ۱۸ اردیبهشت ۱۴۰۵"
    },
    "علوم_تجربی": {
        "name": "کنکور علوم تجربی",
        "date": (2026, 7, 1),  # 12 تیر 1405
        "time": "08:00",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    },
    "هنر": {
        "name": "کنکور هنر",
        "date": (2026, 7, 1),  # 12 تیر 1405
        "time": "08:00",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    },
    "زبان_خارجه": {
        "name": "کنکور زبان و گروه‌های خارجه",
        "date": (2026, 7, 1),  # 12 تیر 1405
        "time": "14:30",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    }
}
