"""
اطلاعات کنکورهای ۱۴۰۵
"""

EXAMS_1405 = {
    "علوم_انسانی": {
        "name": "کنکور علوم انسانی",
        "date": (2025, 7, 2),  # 11 تیر 1405 - اصلاح شده
        "time": "08:00",
        "persian_date": "۱۱ تیر ۱۴۰۵"
    },
    "ریاضی_فنی": {
        "name": "کنکور ریاضی و فنی",
        "date": (2025, 7, 2),  # 11 تیر 1405 - اصلاح شده
        "time": "08:00",
        "persian_date": "۱۱ تیر ۱۴۰۵"
    },
    "فرهنگیان": {
        "name": "کنکور فرهنگیان",
        "date": [(2025, 5, 7), (2025, 5, 8)],  # 17 و 18 اردیبهشت 1405 - اصلاح شده
        "time": "08:00",
        "persian_date": "۱۷ و ۱۸ اردیبهشت ۱۴۰۵"
    },
    "علوم_تجربی": {
        "name": "کنکور علوم تجربی",
        "date": (2025, 7, 3),  # 12 تیر 1405 - اصلاح شده
        "time": "08:00",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    },
    "هنر": {
        "name": "کنکور هنر",
        "date": (2025, 7, 3),  # 12 تیر 1405 - اصلاح شده
        "time": "14:30",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    },
    "زبان_خارجه": {
        "name": "کنکور زبان و گروه‌های خارجه",
        "date": (2025, 7, 3),  # 12 تیر 1405 - اصلاح شده
        "time": "14:30",
        "persian_date": "۱۲ تیر ۱۴۰۵"
    }
}
